; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-20-18)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 - object)
(:init
(at-robby robot1 room14)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room6)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room19)
(at ball2 room15)
(at ball3 room19)
(at ball4 room1)
(at ball5 room15)
(at ball6 room5)
(at ball7 room15)
(at ball8 room14)
(at ball9 room9)
(at ball10 room10)
(at ball11 room2)
(at ball12 room12)
(at ball13 room4)
(at ball14 room13)
(at ball15 room9)
(at ball16 room11)
(at ball17 room16)
(at ball18 room10)
)
(:goal
(and
(at ball1 room3)
(at ball2 room18)
(at ball3 room11)
(at ball4 room15)
(at ball5 room14)
(at ball6 room13)
(at ball7 room16)
(at ball8 room12)
(at ball9 room4)
(at ball10 room6)
(at ball11 room9)
(at ball12 room17)
(at ball13 room11)
(at ball14 room8)
(at ball15 room12)
(at ball16 room10)
(at ball17 room8)
(at ball18 room7)
)
)
)

; plan
1. (pick robot1 ball8 room14 lgripper1)
   deleted: (at ball8 room14) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 0 of 18
2. (move robot2 room6 room9)
   deleted: (at-robby robot2 room6)
   added: (at-robby robot2 room9)
   goals met: 0 of 18
3. (move robot1 room14 room12)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room12)
   goals met: 0 of 18
4. (pick robot2 ball9 room9 lgripper2)
   deleted: (at ball9 room9) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 0 of 18
5. (pick robot2 ball15 room9 rgripper2)
   deleted: (at ball15 room9) (free robot2 rgripper2)
   added: (carry robot2 ball15 rgripper2)
   goals met: 0 of 18
6. (drop robot1 ball8 room12 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room12) (free robot1 lgripper1)
   goals met: 1 of 18
7. (pick robot1 ball12 room12 rgripper1)
   deleted: (at ball12 room12) (free robot1 rgripper1)
   added: (carry robot1 ball12 rgripper1)
   goals met: 1 of 18
8. (move robot2 room9 room4)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room4)
   goals met: 1 of 18
9. (move robot1 room12 room17)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room17)
   goals met: 1 of 18
10. (drop robot2 ball9 room4 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room4) (free robot2 lgripper2)
   goals met: 2 of 18
11. (drop robot1 ball12 room17 rgripper1)
   deleted: (carry robot1 ball12 rgripper1)
   added: (at ball12 room17) (free robot1 rgripper1)
   goals met: 3 of 18
12. (move robot2 room4 room8)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room8)
   goals met: 3 of 18
13. (move robot1 room17 room2)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room2)
   goals met: 3 of 18
14. (move robot2 room8 room12)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room12)
   goals met: 3 of 18
15. (pick robot1 ball11 room2 lgripper1)
   deleted: (at ball11 room2) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 3 of 18
16. (drop robot2 ball15 room12 rgripper2)
   deleted: (carry robot2 ball15 rgripper2)
   added: (at ball15 room12) (free robot2 rgripper2)
   goals met: 4 of 18
17. (move robot1 room2 room9)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room9)
   goals met: 4 of 18
18. (move robot2 room12 room8)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room8)
   goals met: 4 of 18
19. (drop robot1 ball11 room9 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room9) (free robot1 lgripper1)
   goals met: 5 of 18
20. (move robot2 room8 room7)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room7)
   goals met: 5 of 18
21. (move robot1 room9 room5)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room5)
   goals met: 5 of 18
22. (move robot2 room7 room4)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room4)
   goals met: 5 of 18
23. (pick robot1 ball6 room5 lgripper1)
   deleted: (at ball6 room5) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 5 of 18
24. (pick robot2 ball13 room4 lgripper2)
   deleted: (at ball13 room4) (free robot2 lgripper2)
   added: (carry robot2 ball13 lgripper2)
   goals met: 5 of 18
25. (move robot1 room5 room13)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room13)
   goals met: 5 of 18
26. (move robot2 room4 room19)
   deleted: (at-robby robot2 room4)
   added: (at-robby robot2 room19)
   goals met: 5 of 18
27. (drop robot1 ball6 room13 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room13) (free robot1 lgripper1)
   goals met: 6 of 18
28. (pick robot1 ball14 room13 rgripper1)
   deleted: (at ball14 room13) (free robot1 rgripper1)
   added: (carry robot1 ball14 rgripper1)
   goals met: 6 of 18
29. (pick robot2 ball3 room19 rgripper2)
   deleted: (at ball3 room19) (free robot2 rgripper2)
   added: (carry robot2 ball3 rgripper2)
   goals met: 6 of 18
30. (move robot1 room13 room8)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room8)
   goals met: 6 of 18
31. (move robot2 room19 room11)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room11)
   goals met: 6 of 18
32. (drop robot1 ball14 room8 rgripper1)
   deleted: (carry robot1 ball14 rgripper1)
   added: (at ball14 room8) (free robot1 rgripper1)
   goals met: 7 of 18
33. (drop robot2 ball3 room11 rgripper2)
   deleted: (carry robot2 ball3 rgripper2)
   added: (at ball3 room11) (free robot2 rgripper2)
   goals met: 8 of 18
34. (drop robot2 ball13 room11 lgripper2)
   deleted: (carry robot2 ball13 lgripper2)
   added: (at ball13 room11) (free robot2 lgripper2)
   goals met: 9 of 18
35. (pick robot2 ball16 room11 rgripper2)
   deleted: (at ball16 room11) (free robot2 rgripper2)
   added: (carry robot2 ball16 rgripper2)
   goals met: 9 of 18
36. (move robot1 room8 room3)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room3)
   goals met: 9 of 18
37. (move robot2 room11 room10)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room10)
   goals met: 9 of 18
38. (move robot1 room3 room19)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room19)
   goals met: 9 of 18
39. (drop robot2 ball16 room10 rgripper2)
   deleted: (carry robot2 ball16 rgripper2)
   added: (at ball16 room10) (free robot2 rgripper2)
   goals met: 10 of 18
40. (pick robot2 ball18 room10 lgripper2)
   deleted: (at ball18 room10) (free robot2 lgripper2)
   added: (carry robot2 ball18 lgripper2)
   goals met: 10 of 18
41. (pick robot1 ball1 room19 lgripper1)
   deleted: (at ball1 room19) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 10 of 18
42. (move robot1 room19 room3)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room3)
   goals met: 10 of 18
43. (move robot2 room10 room7)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room7)
   goals met: 10 of 18
44. (drop robot1 ball1 room3 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room3) (free robot1 lgripper1)
   goals met: 11 of 18
45. (drop robot2 ball18 room7 lgripper2)
   deleted: (carry robot2 ball18 lgripper2)
   added: (at ball18 room7) (free robot2 lgripper2)
   goals met: 12 of 18
46. (move robot1 room3 room8)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room8)
   goals met: 12 of 18
47. (move robot2 room7 room8)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room8)
   goals met: 12 of 18
48. (move robot1 room8 room10)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room10)
   goals met: 12 of 18
49. (move robot2 room8 room16)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room16)
   goals met: 12 of 18
50. (pick robot1 ball10 room10 lgripper1)
   deleted: (at ball10 room10) (free robot1 lgripper1)
   added: (carry robot1 ball10 lgripper1)
   goals met: 12 of 18
51. (pick robot2 ball17 room16 lgripper2)
   deleted: (at ball17 room16) (free robot2 lgripper2)
   added: (carry robot2 ball17 lgripper2)
   goals met: 12 of 18
52. (move robot1 room10 room6)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room6)
   goals met: 12 of 18
53. (move robot2 room16 room8)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room8)
   goals met: 12 of 18
54. (drop robot1 ball10 room6 lgripper1)
   deleted: (carry robot1 ball10 lgripper1)
   added: (at ball10 room6) (free robot1 lgripper1)
   goals met: 13 of 18
55. (drop robot2 ball17 room8 lgripper2)
   deleted: (carry robot2 ball17 lgripper2)
   added: (at ball17 room8) (free robot2 lgripper2)
   goals met: 14 of 18
56. (move robot1 room6 room18)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room18)
   goals met: 14 of 18
57. (move robot2 room8 room18)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room18)
   goals met: 14 of 18
58. (move robot1 room18 room1)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room1)
   goals met: 14 of 18
59. (move robot2 room18 room15)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room15)
   goals met: 14 of 18
60. (pick robot1 ball4 room1 lgripper1)
   deleted: (at ball4 room1) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 14 of 18
61. (pick robot2 ball7 room15 lgripper2)
   deleted: (at ball7 room15) (free robot2 lgripper2)
   added: (carry robot2 ball7 lgripper2)
   goals met: 14 of 18
62. (pick robot2 ball5 room15 rgripper2)
   deleted: (at ball5 room15) (free robot2 rgripper2)
   added: (carry robot2 ball5 rgripper2)
   goals met: 14 of 18
63. (move robot1 room1 room15)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room15)
   goals met: 14 of 18
64. (move robot2 room15 room16)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room16)
   goals met: 14 of 18
65. (drop robot1 ball4 room15 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room15) (free robot1 lgripper1)
   goals met: 15 of 18
66. (drop robot2 ball7 room16 lgripper2)
   deleted: (carry robot2 ball7 lgripper2)
   added: (at ball7 room16) (free robot2 lgripper2)
   goals met: 16 of 18
67. (pick robot1 ball2 room15 rgripper1)
   deleted: (at ball2 room15) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 16 of 18
68. (move robot1 room15 room18)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room18)
   goals met: 16 of 18
69. (move robot2 room16 room14)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room14)
   goals met: 16 of 18
70. (drop robot1 ball2 room18 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room18) (free robot1 rgripper1)
   goals met: 17 of 18
71. (drop robot2 ball5 room14 rgripper2)
   deleted: (carry robot2 ball5 rgripper2)
   added: (at ball5 room14) (free robot2 rgripper2)
   goals met: 18 of 18
